In [1]:
import pandas as pd

In [35]:
df1 = pd.DataFrame({
    'Employee' : ['Sam', 'Sanju', 'Jim'],
    'Age' : [12, 13, 14],
})
df2 = pd.DataFrame({'Employee' : ['Sam', 'Sanju', 'Jim'],
    'year' : [2001, 2002, 2003],
    'Dept' : ['CSE', 'EEE', 'AI']
    })

df1

  Employee  Age
0      Sam   12
1    Sanju   13
2      Jim   14

In [7]:
df2

    Name  Age Dept
0    Sam   12  EEE
1  Sanju   23  EEE
2    Jim   14  ECE

In [13]:
df3 = pd.merge(df1, df2)
df3

    Name  Age Dept  year
0    Sam   12  CSE  2001
1  Sanju   13  EEE  2002
2    Jim   14  ECE  2003

In [29]:
df3 = pd.merge(df1, df2, on = 'Dept')
df3

   Age Dept   Name  year
0   12  CSE    Sam  2001
1   13  EEE  Sanju  2002

In [34]:
pd.merge(df1, df2, left_on = 'Employee', right_on = 'Name').drop('Name', axis=1)

  Employee  Age  year Dept
0      Sam   12  2001  CSE
1    Sanju   13  2002  EEE
2      Jim   14  2003   AI

In [36]:
df1a = df1.set_index('Employee')
df1a

          Age
Employee
Sam        12
Sanju      13
Jim        14

In [37]:
df2a = df2.set_index('Employee')
df2a

          year Dept
Employee
Sam       2001  CSE
Sanju     2002  EEE
Jim       2003   AI

In [41]:
pd.merge(df1, df2, left_index=True, right_index=True).set_index('Employee_x')

            Age Employee_y  year Dept
Employee_x
Sam          12        Sam  2001  CSE
Sanju        13      Sanju  2002  EEE
Jim          14        Jim  2003   AI

In [43]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'], 'food': ['fish', 'beans', 'bread']})
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'], 'drink': ['wine', 'beer']})

pd.merge(df6, df7, how = 'inner')

   name   food drink
0  Mary  bread  wine

In [45]:
pd.merge(df6, df7, how = 'outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [46]:
pd.merge(df6, df7, how = 'right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [48]:
pd.merge(df6, df7, how = 'left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

# **SERIES**

In [60]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1,2,3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4,5,6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [64]:
pd.concat([df1, df2], ignore_index=True)

  Employee   Age
0      Sam    12
1    Sanju    13
2      Jim    14
3      Sam  2001
4    Sanju  2002
5      Jim  2003

In [69]:
df1.append(df2 , ignore_index = True)

  Employee   Age
0      Sam    12
1    Sanju    13
2      Jim    14
3      Sam  2001
4    Sanju  2002
5      Jim  2003